{
  "HomePage": "HOME",
  "GamePage": "ABOUT GAME ",
  "ServerPage": "ABOUT SERVER",
  "WebPage": "ABOUT WEB-PAGE",
  "Log-in": "LOG IN",
  "Log-out": "LOG OUT",
  "Account": "ACCOUNT",
  "Download": "DOWNLOAD",
  "Details": "DETAILS",
  "GameSettings": "GAME SETTINGS",
  "redirectingWait": "PLEASE WAIT ...",

  "redirecting": "REDIRECTING TO HEROES BATTLE AUTH SERVER, ",
  "redirecting2": "REDIRECTING TO HEROES BATTLE, ",
  "bubble_subtitles": "Online game designed for two players who select one of six heroes and fight to the loss of their lives. The combat area is covered with obstacles that make it difficult to escape ...",
  "button_download": "DOWNLOAD",
  "button_show_animation": "Show animation",
  "button_hide_animation": "Hide animation",
  "Game_mage_title": "Wizards",
  "Game_mage_description": "Gifted magicians, each of them wields a different element. The Wizards are endowed with a lot of mana and regenerate it quickly, but they have little health, so they have to beware of hostile spells.",
  "usesSpell": " uses: ",
  "basicSpell": "basic spell ",
  "ultimateSpell": "ultimate spell ",

  "Game_fallen_title": "Fallens",
  "Game_fallen_description": "A group of rebels who are not afraid of magic. The Fallens are warriors who have a lot of life and mana. But they must hurry to defeat the enemy, because when they deplete their mana, they will regain it very slowly.",
  "Server": "Server ",
  "ServerOn": "ON",
  "ServerOff": "OFF",
  "TooltipPlayers": "Players online",
  "TooltipTime": "Time left to restart room",

  "Size": "Size: ",
  "Loading": "Loading...",

  "Game1": "The game",
  "Game2": " was written mostly in ",
  "Game3": "along with the use of technology",
  "Game4" : " and library ",
  "Game5" : ". The game client application required, first of all, its own texture rendering engine, the characters and spells moving mechanics development, exchanging messages with the server and handling thread concurrency.",
  "Game6" : "The game server application was written using the framework",
  "Game7" : " and technology ",
  "Game8" : ". The application's task is primarily to send messages during the game. The application allows users to download a packed client application and control the game options via API. The game server application is also a resource server whose access is supervised by the authentication and authorization server ",
  "Game9" : "The web application was prepared with help of a framework ",
  "Game10" : "The server and web application were placed on the server ",
  "LearnMore": "Learn more",

  "Details_tab1": "Concurrency",
  "Details_tab2": "Menu mechanics",
  "Details_tab3": "Game mechanics",
  "Details_tab4": "Communication between game clients",
  "Details_content1": "Two threads can be distinguished in the final version of the client application. The first one is responsible for displaying content, interacting with the menu, and the course of the game itself until its end. The second thread is launched during player registration and is responsible for exchanging messages with another application via the server. ",
  "Details_content2": "The challenge was to create the application in such a way that active threads would not block each other and would not throw exceptions or freeze the game temporarily. The best solution to this problem turned out to be the application of the Active Object * design pattern. ",
  "Details_content3": "* You can read more about the design pattern in Robert C. Martin's book, Agile Software Development. Best principles, patterns and practices , 2003.",
  "Details_content4": "The menu tabs are designed as objects that contain permanent images, temporary images and buttons. The permanent images are the background of the menu, the temporary images inform the player of his selection and the buttons are the interactive menu items. ",
  "Details_content5": "By making the buttons follow the Observer design pattern, they respond to events, allowing you to start or stop the game, move between cards, choose a character or give a name to a player. The animation of the character casting the spell is a looped slice of the game with a randomly selected spell. ",
  "Details_content6": "The game board is a single image with a series of smaller objects defined at the site of obstacles or changes to the terrain. These objects are not displayed, but they are an integral part of the map and make the encountered elements an obstacle for the protagonist, which makes the game more realistic. ",
  "Details_content7": "Heroes and spells are objects that are controlled by the player using the LWJGL library. Appropriate algorithms control, among others the hero's life and its loss if the enemy spell hits the hero, mana and its regeneration, and movement so that the character does not collide with obstacles. ",
  "Details_content8": "The exchange of messages is an important element of the game, because thanks to it, the interaction between players takes place, and the heroes and spells are in motion. During the game, hundreds of messages are sent and received using the WebSocket technology. ",
  "Details_content9": "In order to keep the game flowing while maintaining high performance, messages need to be properly processed before sending and receiving. Sent messages are kept to a minimum, they are sent only when the hero's position, life or mana changes. During the exchange, messages are not received in the order in which they were sent, so received messages must be properly filtered beforehand to avoid the hero's 'going back' to the previous position. ",

  "Ins_header_1": "1.  OpenJDK 11 installation instructions (necessary Java runtime environment)",
  "Ins_description_1": "This step can be skipped if you already have OpenJDK 11+",
  "Ins_header_1_windows": "1. Download the game",
  "Ins_description_1_windows": "Select, if you already have OpenJDK 11 + ",
  "Ins_header_2": "2. Download the game ",
  "Ins_header_2_bundled_jre": "Download the game with bundled JRE",
  "Ins_text_1": "In order to run an application (game) written in Java, you need to put JRE (Java Runtime Environment) on your unit. JRE is included in OpenJDK (Open Java Development Kit). ",
  "Ins_text_2": "The package with the game includes JRE, you can start the game immediately after installation.",
  "Ins_title_1": "A) Downloading OpenJDK 11",
  "Ins_link": "Link: ",
  "Ins_link2": "Download OpenJDK",

  "Ins_text_21": "Confirm by clicking",
  "Ins_text_22": "From now on, you will be able to easily run Java applications in the command line.",
  "Ins_text_23": "*If you have any problems with installation OpenJdk, check here",
  "Ins_title_2": "B) Introducing an environment variable",
  "Ins_text2_1": "Requirements: ",
  "Ins_text2_2": "Operating system Windows 10 ",
  "Ins_text2_2A": "Operating system Linux i.e. Ubuntu 18.04",
  "Ins_text2_3": "Installed OpenJDK 11",
  "Ins_text2_4": "Memory: 2 GB RAM",
  "Ins_text_download": "DOWNLOAD HEROES BATTLE",
  "Ins_linux_text1": "Extract the downloaded file to the required location.",
  "Ins_linux_text2": "Set",
  "Ins_linux_text3": "JAVA_HOME",
  "Ins_linux_text4": "using the syntax export JAVA_HOME='path to OpenJDK'.",
  "Ins_linux_text5": "For instance, 'export JAVA_HOME= /usr/java/jdk-11/.'",
  "Ins_linux_text6": "PATH",
  "Ins_linux_text7": "using the syntax export PATH=${PATH}:'path to the OpenJDKJDK bin'. ",
  "Ins_linux_text8": "For example, 'export PATH=${PATH}:/usr/java/jdk-11/bin'",
  "Ins_linux_text9": " Verify the settings using the following commands:",
  "Ins_linux_text10": "echo $JAVA_HOME",
  "Ins_linux_text11": "echo $PATH",
  "Ins_linux_text12": "The output must display the JAVA_HOME and PATH that you set."
}
